
&НаСервере
Процедура УзнатьGUIDНаСервере()
	Объект.GUID = Строка(Объект.СсылкаНаОбъект.УникальныйИдентификатор());
	
	МассивЧастейGUID = СтрРазделить(Объект.GUID, "-");
	Если МассивЧастейGUID.Количество() > 0 Тогда
		_IDRRef = "0x" + ВРег(МассивЧастейGUID[3] + МассивЧастейGUID[4] + МассивЧастейGUID[2] + МассивЧастейGUID[1] + МассивЧастейGUID[0]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УзнатьGUID(Команда)
	УзнатьGUIDНаСервере();
КонецПроцедуры

&НаСервере
Процедура УзнатьОбъектНаСервере()
	СтрокаGUID = Объект.GUID;
	
	НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
	
	СсылкаЗаполнена = Ложь;
	
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		СсылкаМетаданные = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(НовыйGUID);
		Если ЗначениеЗаполнено(СсылкаМетаданные.Наименование) Тогда
			Объект.СсылкаНаОбъект = СсылкаМетаданные;
			СсылкаЗаполнена = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не СсылкаЗаполнена Тогда
		Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
			СсылкаМетаданные = Документы[ОбъектМетаданных.Имя].ПолучитьСсылку(НовыйGUID);
			Если ЗначениеЗаполнено(СсылкаМетаданные.Номер) Тогда
				Объект.СсылкаНаОбъект = СсылкаМетаданные;
				СсылкаЗаполнена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не СсылкаЗаполнена Тогда
		Для Каждого ОбъектМетаданных Из Метаданные.ПланыОбмена Цикл
			СсылкаМетаданные = ПланыОбмена[ОбъектМетаданных.Имя].ПолучитьСсылку(НовыйGUID);
			Если ЗначениеЗаполнено(СсылкаМетаданные.Наименование) Тогда
				Объект.СсылкаНаОбъект = СсылкаМетаданные;
				СсылкаЗаполнена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	Если Не СсылкаЗаполнена Тогда
		Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовРасчета Цикл
			СсылкаМетаданные = ПланыВидовРасчета[ОбъектМетаданных.Имя].ПолучитьСсылку(НовыйGUID);
			Если ЗначениеЗаполнено(СсылкаМетаданные.Наименование) Тогда
				Объект.СсылкаНаОбъект = СсылкаМетаданные;
				СсылкаЗаполнена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не СсылкаЗаполнена Тогда
		Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовХарактеристик Цикл
			СсылкаМетаданные = ПланыВидовХарактеристик[ОбъектМетаданных.Имя].ПолучитьСсылку(НовыйGUID);
			Если ЗначениеЗаполнено(СсылкаМетаданные.Наименование) Тогда
				Объект.СсылкаНаОбъект = СсылкаМетаданные;
				СсылкаЗаполнена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	Если Не СсылкаЗаполнена Тогда
		Для Каждого ОбъектМетаданных Из Метаданные.ПланыСчетов Цикл
			СсылкаМетаданные = ПланыСчетов[ОбъектМетаданных.Имя].ПолучитьСсылку(НовыйGUID);
			Если ЗначениеЗаполнено(СсылкаМетаданные.Наименование) Тогда
				Объект.СсылкаНаОбъект = СсылкаМетаданные;
				СсылкаЗаполнена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УзнатьОбъект(Команда)
	УзнатьОбъектНаСервере();
КонецПроцедуры
